import { text } from 'stream/consumers';

export const policyText = {
  title: 'Политика конфиденциальности',
  subtitle: 'Политика обработки персональных данных',
  text1:
    'Настоящая Политика обработки персональных данных (далее по тексту – «Политика») подготовлена Администрацией Сайта в соответствии с положениями и требованиями действующего законодательства Республики Беларусь и направлена на определение условий в отношении получения (сбора) информации о Пользователях и Респондентах, использования и передачи информации о Пользователях и Респондентах, предоставления доступа к информации о Пользователях и Респондентах третьим лицам.',
  text2:
    'Настоящая Политика является юридически обязательным документом для Пользователей и Респондентов, использующих Сайт в соответствии с его основным назначением. Каждый Пользователь и Респондент обязуется ознакомиться с настоящей Политикой до момента начала использования Сайта.',
  text3:
    'Администрация Сайта и Пользователь/Респондент далее по тексту Политики совместно упоминаются как – «Стороны», а по отдельности как – «Сторона».',
  sections: [
    {
      title: '1. Термины, используемые в Политике',
      subtitle: [
        {
          marker: '1.',
          text: 'В целях настоящей Политики нижеприведенные термины используются в следующем значении:',
          notes: [
            {
              marker: '1.',
              text: 'Сайт – результат интеллектуальной деятельности, представляющий собой составное произведение, расположенное в информационно-телекоммуникационной сети Интернет под определенным сетевым адресом (доменом, доменным именем) и включающее в себя программы для ЭВМ (программное обеспечение), обеспечивающие его технологическое и техническое функционирование, графическое решение (дизайн, порядок расположения элементов, применяемая цветовая гамма и т.д.), контент, а именно текстовую информацию, фотографические изображения, картинки, видеозаписи, аудиозаписи и др., объединенные единым назначением и смыслом и представленные в виде веб-страниц. Под Сайтом в тексте настоящего Соглашения понимается Сайт, принадлежащий Администрации Сайта, расположенный в информационно-телекоммуникационной сети Интернет под доменным именем (доменом, адресом) – www.askolok.by, а также входящие в его состав производные веб-страницы. ',
            },
            {
              marker: '2.',
              text: 'Администрация Сайта – Асколок А.Ю., обладающая правами использования, управления и распоряжения Сайтом, предоставляющее Сайт в пользование Пользователям и оказывающее Пользователям услуги, предусмотренные настоящим Соглашением, описанные непосредственно на самом Сайте или определенные техническим функционалом Сайта. Пользователь – физическое лицо, индивидуальный предприниматель или юридическое лицо в лице своего представителя, осуществляющее его использование в соответствии с основным назначением Сайта.',
            },
            {
              marker: '3.',
              text: 'Респондент – физическое лицо, проходящее Опрос и предоставляющее ответы на вопросы, поставленные в рамках Опроса, или выполняющее задания, поставленные в рамках Опроса.',
            },
            {
              marker: '4.',
              text: 'Опрос – совокупность вопросов и/или заданий на ту или иную тематику с вариантами ответов (при их наличии), публикуемых Пользователем на Сайте, в целях выяснения мнения Респондентов и получения ответов на них от Респондентов.',
            },
            {
              marker: '5.',
              text: 'Информация (данные) – любые сведения о Пользователе/Респонденте или касающиеся Пользователя/Респондента.',
            },
            {
              marker: '6.',
              text: 'Электронная почта (E-mail) – специальная технология, которая обеспечивает пересылку и получение электронных сообщений, писем, файлов, документов и т.д. посредством использования информационно-телекоммуникационной сети Интернет.',
            },
            {
              marker: '7.',
              text: ' Обработка персональных данных — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.',
            },
          ],
        },
        {
          marker: '2.',
          text: 'В Политике могут быть использованы термины, не определенные в пункте 1.1. настоящей Политики. В этих случаях толкование терминов производится в соответствии с текстом и смыслом данной Политики. В случае отсутствия однозначного толкования термина в тексте Политики, следует руководствоваться, во-первых, толкованием терминов, применяемым на Сайте, в том числе, но не ограничиваясь указанным, в иной юридической документации, размещенной на Сайте; во-вторых, обычаями деловой практики в соответствующей сфере деятельности; в-третьих, положениями действующего законодательства Республики Беларусь.',
        },
        {
          marker: '3.',
          text: 'Все определения, предусмотренные пунктом 1.1. настоящей Политики, могут использоваться как в единственном, так и во множественном числе, без ущерба для их значения.',
        },
        {
          marker: '4.',
          text: 'Все определения настоящей Политики сформулированы лишь для удобства и не могут повлиять на юридическую значимость отдельных положений Политики.',
        },
      ],
    },
    {
      title: '2. Акцепт Политики',
      subtitle: [
        {
          marker: '1.',
          text: 'Cовокупности и во взаимосвязи, а также каждого в отдельности условия Политики, полное, безоговорочное, безусловное и безотзывное согласие Пользователя или Респондента со всеми положениями, условиями и требованиями, определёнными в Политике.',
        },
        {
          marker: '2.',
          text: 'Предоставляя свой акцепт Политики, Пользователь/Респондент принимает на себя обязательство неукоснительно соблюдать все правила, установленные в Политике. Акцепт Политики свидетельствует о намерении, волеизъявлении, желании и согласии Пользователя/Респондента соблюдать и исполнять условия настоящей Политики.',
        },
        {
          marker: '3.',
          text: ' С момента акцепта настоящей Политики считается, что Пользователь/Респондент принял правила, установленные в Политике, и вступил в правоотношения с Администрацией Сайта.',
        },
        {
          marker: '4.',
          text: 'Акцепт Политики осуществляется путем совершения Пользователем/Респондентом конклюдентных (фактических) действий, свидетельствующих о его прочтении и принятии условий Политики. В рамках настоящей Политики и при использовании Сайта акцептом Политики признается фактическое использование Сайта (его технических возможностей и функционала), и/или регистрация Пользователя/Респондента на Сайте. Дополнительно и отдельно от указанного акцептом Политики также признается и считается оплата услуг, оказываемых Администрацией Сайта на возмездной основе.',
        },
      ],
    },
    {
      title: '3. Цель Политики',
      subtitle: [
        {
          marker: '1.',
          text: 'Настоящая Политика имеет своей целью обеспечение надлежащей охраны Информации о Пользователях, в том числе их персональных данных, от неправомерного доступа к ней со стороны третьих лиц, определение порядка получения, предоставления и использования Информации о Пользователях.',
        },
        {
          marker: '2.',
          text: ' Настоящая Политика направлена на определение исключительно общих положений в отношении получения и использования Информации о Пользователях. Отдельные особенности получения и использования Информации могут быть установлены иными документами, опубликованными на Сайте, или могут определяться техническим устройством Сайта.',
        },
      ],
    },
    {
      title: '4. Персональные данные пользователей',
      subtitle: [
        {
          marker: '1.',
          text: 'Перечень Информации, необходимой для использования Сайта, устанавливается исключительно по усмотрению Администрацией Сайта.',
        },
        {
          marker: '2.',
          text: 'Цели обработки персональных данных:',
          notes: [
            {
              marker: '-',
              text: 'исполнение своих договорных обязательств перед Пользователями/Респондентами, в частности для предоставления сервисов Сайта в пользование Пользователям/Респондентам, оказания услуг, определенных функционалом Сайта;',
            },
            {
              marker: '-',
              text: 'идентификация Пользователей/Респондентов при учете, систематизации, накоплении и передачи той или иной информации о них или для них и т.д.;',
            },
            {
              marker: '-',
              text: 'общение и переписка с Пользователями/Респондентами, предоставление ответов на вопросы Пользователей/Респондентов в режиме обратной связи, уведомление Пользователей/Респондентов о существенно значимых обстоятельствах при использовании Сайта и т.д.',
            },
          ],
        },
        {
          marker: '3.',
          text: 'Пользователь – физическое лицо размещает на Сайт следующие данные: фамилия, имя, отчество, адрес электронной почты, пароль, номер контактного телефона, адрес и другие данные по усмотрению Администрации Сайта.',
        },
        {
          marker: '4.',
          text: 'Респондент размещает на Сайте те данные, которые определены Администрацией Сайта и установлены техническим функционалом Сайта. Респондент понимает, дает свое разрешение и соглашается с тем, что указывая на Сайте свои персональные данные, они станут доступны для Пользователя, проводящего соответствующий Опрос. ',
        },
        {
          marker: '5.',
          text: 'Размещение на Сайте персональных данных Пользователя/Респондента преследует цель – создание и проведение Опросов Пользователями среди Респондентов.',
        },
        {
          marker: '6.',
          text: ' Пользователь/Респондент вправе удалить персональную информацию, а также любую другую информацию о себе, размещенную им на Сайте. Для этого Пользователь/Респондент должен обратиться к Администрации Сайта по Электронной почте: askolok@gmail.com с запросом на удаление, изменение персональных данных Пользователя/Респондента.',
        },
        {
          marker: '7.',
          text: 'Используя Сайт, Пользователь/Респондент соглашается и принимает, что Администрация Сайта оставляет за собой право использовать его персональные данные анонимно и в обобщенном виде для статистических целей. ',
        },
        {
          marker: '8.',
          text: 'Администрация Сайта обязуется не предоставлять никакие персональные данные о Пользователях/Респондентах частным лицами и организациям, заявляющим о возможном нецелевом использовании подобной информации (рассылки несанкционированной рекламы, спама, предоставлении информации другим лицам и тому подобное).',
        },
        {
          marker: '9.',
          text: 'Администрация Сайта не отвечает за возможное нецелевое использование информации, размещенной на Сайте, Пользователями/Респондентами или иными лицами, которое произошло без уведомления Администрации Сайта с нарушением информационной безопасности Сайта или при отсутствии такого нарушения.',
        },
        {
          marker: '10.',
          text: 'Пользователь/Респондент обязуется хранить данные для использования Сайта в недоступном для любых третьих лиц месте, а также не сообщать и не предоставлять соответствующие сведения третьим лицам. Пользователь/Респондент несет полную ответственность и риск всех возможных потенциальных и реальных негативных последствий, связанных с неисполнением настоящего правила.',
        },
        {
          marker: '11.',
          text: 'Администрация Сайта обрабатывает только те персональные данные Пользователей, которые были размещены на Сайте. Персональные данные Пользователей обрабатываются с помощью программно-аппаратных и технических средств Сайта.',
        },
      ],
    },
    {
      title: '2. Источники получения информации',
      subtitle: [
        {
          marker: '1.',
          text: 'Администрация Сайта получает информацию о Пользователях/Респондентах следующими способами (из следующих источников):',
          notes: [
            {
              marker: '-',
              text: 'Информация, предоставляемая непосредственно самими Пользователями/Респондентами, в том числе, но не ограничиваясь нижеизложенным:',
            },
            {
              marker: '-',
              text: 'Информация о Пользователе/Респонденте, полученная от другого Пользователя/Респондента, в частности адрес электронной почты для направления уведомлений и сообщений;',
            },
            {
              marker: '-',
              text: 'Информация о Пользователе/Респонденте, указанная в рамках формирования и создания Опроса или предоставления ответов на вопросы/задания Опроса.',
            },
            {
              marker: '-',
              text: ' Информация о Пользователе/Респонденте, предоставленная по мотивированному запросу Администрации Сайта.',
            },
            {
              marker: '-',
              text: 'Администрация Сайта вправе по своему усмотрению запрашивать или обязать указывать Пользователя/Респондента любую Информацию, необходимую ей для исполнения своих обязательств перед Пользователями/Респондентами. Настоящим на Пользователя/Респондента возлагается обязанность по предоставлению исключительно достоверной, полной и актуальной информации о Пользователе/Респонденте.',
            },
          ],
        },
        {
          marker: '2.',
          text: 'Информация из программных, технических и аппаратных служб (программного обеспечения и т.д.), применяемых Пользователем/Респондентом при просмотре веб-страниц Сайта, в том числе, но не ограничиваясь нижеизложенным:',
          notes: [
            {
              marker: '-',
              text: 'Информация о программно-аппаратных устройствах, которые используются Пользователями/Респондентами при посещении Сайта, в том числе модель и версия операционной системы, уникальные идентификаторы устройств, а также данные о мобильной сети и номере телефона, с которого Пользователь/Респондент осуществляет посещение Сайта;',
            },
            {
              marker: '-',
              text: 'Информация, зафиксированная в журналах серверов, в частности сведения о поисковых запросах Пользователей/Респондентов, файлах cookie, IP-адресе, о сбоях в работе системы, данные cookie, данные о просмотре Пользователем/Респондентом тех или иных веб-страниц Сайта;',
            },
            {
              marker: '-',
              text: 'Информация о территориальном месте нахождения Пользователя/Респондента, предоставляемая через сеть Интернет и т.д.;',
            },
            {
              marker: '-',
              text: 'Информация о домене провайдера Пользователя/Респондента, стране его места нахождения и т.д.',
            },
          ],
        },
      ],
    },
    {
      title: '2. Уведомления и заверения',
      subtitle: [
        {
          marker: '1.',
          text: 'Настоящим Пользователь/Респондент признает и соглашается, что размещение им информации на Сайте, а также ее передача Администрации Сайта, в том числе своих персональных данных осуществляется самостоятельно, добровольно и по своему личному усмотрению Пользователя/Респондента. Размещая на Сайте свои персональные данные, Пользователь/Респондент подтверждает, что делает это добровольно, а также, что он добровольно предоставляет их Администрации Сайта для обработки.',
        },
        {
          marker: '2.',
          text: 'Настоящим Пользователь/Респондент дает согласие на обработку его персональных данных в соответствии с положениями действующего законодательства Республики Беларусь. Администрация Сайта вправе использовать персональные данные Пользователя/Респондента в целях исполнения своих обязательств перед Пользователем/Респондентом, в том числе указанных и определенных в Пользовательском соглашении, в соответствии с условиями действующего законодательства о персональных данных.',
        },
        {
          marker: '3.',
          text: 'Администрация Сайта гарантирует, что в отношении персональных Пользователей/Респондентов совершаются только те действия, которые необходимы или желаемы для достижения указанных выше целей, включая: сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), блокирование, удаление, уничтожение персональных данных. Обработка персональных данных осуществляется как с использованием средств автоматизации, так и без использования таких средств.',
        },
        {
          marker: '4.',
          text: 'Настоящим Пользователь/Респондент дает согласие на направление ему Администрацией Сайта (на Электронную почту, в Личный кабинет, на номер телефона, иными способами) различных sms-рассылок, e-mail-писем и иных форм направления/получения информации, в том числе рекламных и информационных сообщений любого рода и содержания. При этом Пользователь/Респондент вправе самостоятельно определять (регулировать) периодичность поступления в его адрес (на адрес Электронной почты) рекламных или информационных сообщений (периодичность рассылки). Вместе с тем, несмотря на ограничения по рассылке, установленные Пользователем/Респондентом, Администрация Сайта вправе по своему усмотрению направлять в его адрес любые сообщения в любое время.',
        },
        {
          marker: '5.',
          text: 'Администрация Сайта не проверяет достоверность Информации, предоставляемой или полученной от Пользователей/Респондентов, не осуществляет контроль за их право- и дееспособностью. Презюмируется и Администрация Сайта исходит из того, что Пользователь/Респондент во всех без исключения случаях предоставляет полную и достоверную информацию о себе и поддерживает данную информацию в актуальном состоянии.',
        },
        {
          marker: '6.',
          text: ' Администрация Сайта при обработке персональных данных Пользователей/Респондентов обязуется принять все организационные и технические меры для их защиты от несанкционированного доступа способом, не предусмотренным Сайтом. Однако не исключено, что в результате сбоя в работе Сайта, вирусной или хакерской атаки, технических неисправностей и иных обстоятельств персональные данные Пользователей/Респондентов могут стать доступными и другим лицам.',
        },
        {
          marker: '7.',
          text: 'Администрация Сайта обязуется не размещать на Сайте персональные данные других лиц, а также не использовать персональные данные других Пользователей/Респондентов каким-либо образом, не соответствующим требованиям законодательства Республики Беларусь, в противоправных или противозаконных целях, в целях извлечения выгоды и любых иных целях, не соответствующих целям Сайта.',
        },
      ],
    },
    {
      title: '3. Передача информации о пользователе',
      subtitle: [
        {
          marker: '1.',
          text: 'Администрация Сайта не вправе, за исключением случаев, указанных в пункте 6.2. настоящей Политики, без согласия Пользователя/Респондента передавать Информацию о Пользователе/Респонденте третьим лицам как на возмездной, так и на безвозмездной основе.',
        },
        {
          marker: '2.',
          text: 'Администрация Сайта вправе без согласия Пользователя/Респондента и без его предварительного уведомления передать информацию о Пользователя/Респонденте в следующих случаях:',
          notes: [
            {
              marker: '-',
              text: 'государственным органам, в том числе правоохранительным органам, органам дознания и следствия, суда, органам местного самоуправления по их мотивированному запросу;',
            },
            {
              marker: '-',
              text: 'на основании судебного акта третьим лицам;',
            },
            {
              marker: '-',
              text: 'третьим лицам и общественным организациям по их мотивированному запросу в случае нарушения или предполагаемого нарушения их прав;',
            },
            {
              marker: '-',
              text: 'в иных предусмотренных действующим законодательством случаях.',
            },
          ],
        },
      ],
    },
    {
      title: '3. Сведения о реализуемых требованиях к защите персональных данных',
      subtitle: [
        {
          marker: '1.',
          text: 'Администрацией Сайта при предоставлении Сайта в пользование Пользователям/Респонденатм соблюдается неприкосновенность частной жизни субъектов персональных данных. Администрация Сайта заботится о защите персональных данных, которые предоставляются ей Пользователями/Респондентами.',
        },
        {
          marker: '2.',
          text: 'Доступ к информации, составляющей персональные данные, ограничен. Обеспечено принятие организационных, правовых и технических мер для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования, предоставления, распространения персональных данных, а также от иных неправомерных действий в отношении персональных данных в соответствии с установленными требованиями уполномоченных органов власти.',
        },
        {
          marker: '3.',
          text: ' Администрацией Сайта выполняются требования к защите персональных данных при их обработке, в том числе в информационных системах персональных данных, установленные законодательством Республики Беларусь',
        },
      ],
    },
    {
      title: '3. Порядок разрешения споров',
      subtitle: [
        {
          marker: '1.',
          text: ' Настоящим Администрация сайта и Пользователь/Респондент установили претензионный досудебный порядок урегулирования разногласий и споров, вытекающих из применения настоящей Политики. Срок для ответа на предъявленную претензию составляет 10 (десять) рабочих дней с момента ее получения.',
        },
        {
          marker: '2.',
          text: 'В случае не достижения договоренности по спорным вопросам спор, вытекающий из данной Политики, подлежит рассмотрению в судебном порядке в соответствии с действующим законодательством по месту нахождения Администрации Сайта.',
        },
      ],
    },
    {
      title: '4. Действие политики',
      subtitle: [
        {
          marker: '1.',
          text: 'Настоящая Политика вступает в силу с момента ее размещения в сети Интернет на Сайте, указанном в пункте 1.1.1. данной Политики.',
        },
        {
          marker: '2.',
          text: 'Настоящая Политика введена в действие на неопределенный срок и утрачивает свою силу при ее аннулировании Администрацией Сайта.',
        },
        {
          marker: '3.',
          text: 'В случае внесения изменений в Политику, такие изменения вступают в силу с момента опубликования новой редакции Политики на Сайте, если иной срок вступления изменений в силу не определен дополнительно при ее публикации. Администрация Сайта вправе в одностороннем порядке осуществлять внесение изменений в текст Политики.',
        },
        {
          marker: '4.',
          text: 'Пользователь/Респондент обязуется самостоятельно осуществлять контроль за изменениями в положения настоящей Политики и несет ответственность и негативные последствия, связанные с несоблюдением данной обязанности.',
        },
        {
          marker: '5.',
          text: 'При несогласии Пользователя/Респондента с соответствующими изменениями Пользователь/Респондент обязан прекратить использование Сайта и отказаться от услуг, предоставляемых Администрацией Сайта. В противном случае продолжение использования Пользователем/Респондентом Сайта означает, что Пользователь/Респондент согласен с условиями Политики в новой редакции.',
        },
        {
          marker: '6.',
          text: ' Актуальная версия Политики расположена на Сайте по адресу: https://askolok.by',
        },
        {
          marker: '7.',
          text: 'Настоящая Политика была составлена на русском языке. В случае наличия каких-либо несоответствий между версией Политики, составленной на русском языке, и версией Политики, переведенной на другой язык, приоритет и прямое применение будут иметь положения Политики, составленной на русском языке.',
        },
      ],
    },
  ],
};
