export const publicContract = {
  title: 'ПУБЛИЧНЫЙ ДОГОВОР',
  subtitle: 'ПУБЛИЧНЫЙ ДОГОВОР',
  section1: '1. ОПРЕДЕЛЕНИЯ, ИСПОЛЬЗУЕМЫЕ В НАСТОЯЩЕМ ДОГОВОРЕ',
  sections: [
    {
      title: '2. ПРЕДМЕТ ДОГОВОРА',
      subtitle: [
        {
          text: '2.1. В порядке и на условиях, определенных настоящим Договором, Исполнитель принимает на себя обязанность предоставить Заказчику услуги разработка веб-сайта, на возмездной основе, в соответствии с условиями настоящей публичной оферты.',
        },
        {
          text: ' 2.2. Услуга разработка веб-сайта включают в себя:',
        },
        {
          text: '- проектирование сайта (сбор и анализ требований, разработка технического задания, проектирование интерфейсов);',
        },
        {
          text: '- разработка креативной концепции сайта; - создание дизайн-концепции сайта;',
        },
        {
          text: ' - создание макетов страниц;',
        },
        {
          text: '- создание мультимедиа-объектов;',
        },
        {
          text: '- вёрстка страниц и шаблонов;',
        },
        {
          text: '- программирование (разработка функциональных инструментов) или интеграция в систему управления содержимым (CMS);',
        },
        {
          text: '- оптимизация и размещение материалов сайта;',
        },
        {
          text: ' - тестирование и внесение корректировок;',
        },
        {
          text: '- публикация проекта на хостинге;',
        },
        {
          text: '- обслуживание работающего сайта или его программной основы.',
        },
        {
          text: '2.3. Заказчик оплачивает Исполнителю стоимость услуг в размере и порядке, установленным настоящим Договором.',
        },
        {
          text: '2.4. Стороны согласуют вид и объем услуг, их стоимость и сроки путем переговоров.',
        },
        {
          text: '2.5. Услуги оказываются по месту нахождения исполнителя – г. Могилев. Услуги оказываются дистанционно с использованием информационно-телекоммуникационной сети «Интернет».',
        },
        {
          text: '2.6. Услуги могут быть оказаны как в разовом формате, так и в формате ежемесячного сопровождения. Формат услуг определяется сторонами по согласованию.',
        },
      ],
    },
    {
      title: '3. ПОРЯДОК ОКАЗАНИЯ УСЛУГ',
      subtitle: [
        {
          text: '3.1. Услуги могут оказываться Исполнителем очно и/или дистанционно (при помощи информационно-телекоммуникационной сети Интернет).',
        },
        {
          text: '3.2. Услуги оказываются Исполнителем самостоятельно.',
        },
        {
          text: '3.3. Услуги могут оказываются одновременно нескольким Заказчикам. Заказчик понимает это и соглашается с этим условием.',
        },
        {
          text: ' 3.4. Перечень оказываемых услуг приведен на сайте Исполнителя http://askolok.by и является неотъемлемой частью настоящего Договора.',
        },
      ],
    },
    {
      title: '4. ОПЛАТА ОФЕРТЫ И ЗАКЛЮЧЕНИЕ ДОГОВОРА.',
      subtitle: [
        {
          text: '4.1. Настоящий Договор является публичным договором, в соответствии со статьей 396 Гражданского кодекса Республики Беларусь, согласно которому Исполнитель берет на себя обязательство по оказанию Услуг в отношении потребителей услуг (Заказчиков), обратившихся за указанными Услугами.',
        },
        {
          text: '4.2. Размещение текста настоящего Договора в социальной сети Интернет по адресу: http://askolok.by является офертой Исполнителя, адресованной потребителю услуг (потребителям) – Заказчику (Заказчикам) заключить настоящий Договор, согласно пункту 2 статьи 407 Гражданского кодекса Республики Беларусь.',
        },
        {
          text: '4.3. Заключение настоящего Договора производится путем присоединения Заказчика к настоящему Договору в целом, без каких-либо условий, изъятий и оговорок, в соответствии статьей 398 Гражданского кодекса Республики Беларусь.',
        },
        {
          text: '4.4. Для заключения Договора Заказчик направляет Исполнителю Заявку на оказание услуг. Заявка может быть направлена любым установленным Договором способом:- отправка заявки на е-mail адрес: askolok@gmail.com,- путем направления личного сообщения в социальной сети в аккаунт Исполнителя, либо в иной другой мессенджер,- заполнение формы заявки на сайте.',
        },
        {
          text: '4.5. Заказчик полностью несет ответственность за правильность и достоверность указанных им контактных данных, поскольку по указанным контактным данным будет производиться обмен информацией.',
        },
        {
          text: '4.6. Фактом, подтверждающим принятие Заказчиком условий настоящего Договора, является оплата Заказчиком Услуг в порядке и на условиях, определенных настоящим Договором.',
        },
        {
          text: '4.7. Настоящий Договор, при условии, соблюдения порядка его оплаты считается заключенным в простой письменной форме с соблюдением условий статьей 404 и 408 Гражданского кодекса Республики Беларусь.',
        },
        {
          text: '4.8. Данная Оферта является действительной в той редакции и на тех условиях, которые существовали на момент ее оплаты.',
        },
        {
          text: '4.9. Договор действует с момента поступления оплаты Исполнителю до момента завершения обязательств и взаиморасчетов между Сторонами.',
        },
        {
          text: '4.10. Оплата Заказчиком услуг Исполнителя подтверждает, что Заказчик ознакомился с условиями настоящей публичной оферты и полностью и безоговорочно принимает их. Частичный акцепт Оферты, а также акцепт Оферты на иных условиях не допускается',
        },
      ],
    },
    {
      title: '5. ПРАВА И ОБЯЗАННОСТИ СТОРОН',
      subtitle: [
        {
          text: '5.1. Исполнитель обязуется: ',
        },
        {
          text: '5.1.1. оказать Заказчику Услуги в объеме и в сроки, согласованные сторонами настоящего Договора.',
        },
        {
          text: '5.1.2. предоставить Заказчику полную информацию об услугах и порядке их оказания.',
        },
        {
          text: '5.1.3. сохранять коммерческую тайну Заказчика по любым вопросам, которые стали известны Исполнителю в связи с оказываемыми Услугами.',
        },
        {
          text: '5.2. Исполнитель имеет право: . сохранять коммерческую тайну Заказчика по любым вопросам, которые стали известны Исполнителю в связи с оказываемыми Услугами.',
        },
        {
          text: '5.2.1. определять самостоятельно формы, методы и способы проведения консультации в соответствии с требованиями законодательства Республики Беларусь',
        },
        {
          text: '5.3. Заказчик обязуется:',
        },
        {
          text: '5.3.1. оплатить Услуги в соответствии с условиями Договора.',
        },
        {
          text: '5.3.2. предоставить Исполнителю все сведения и данные, необходимые для выполнения Исполнителем своих обязательств по настоящему Договору.',
        },
        {
          text: '5.3.3. не разглашать конфиденциальную информацию и иные данные, предоставленные Исполнителем в связи с исполнением настоящего Договора.',
        },
        {
          text: '5.4. Заказчик имеет право:',
        },
        {
          text: '5.4.1. требовать от Исполнителя надлежащего выполнения его обязательств по настоящему Договору.',
        },
      ],
    },
    {
      title: '6. СТОИМОСТЬ УСЛУГ И ПОРЯДОК РАСЧЕТОВ',
      subtitle: [
        {
          text: '6.1. Стоимость Услуг, предоставляемых согласно данной публичной оферте, определяется исходя из выбранного Заказчиком вида услуг и их стоимости.',
        },
        {
          text: '6.2. Стоимость Услуг по настоящему Договору оплачивается Заказчиком:- оплата с помощью банковской карты используя онлайн-оплату.',
        },
        {
          text: '6.3. Заказчик имеет право на возврат денежных средств, оплаченных Исполнителю в качестве предоплаты за оказание услуг по настоящему договору в случае неоказания услуг по настоящему договору.Исполнитель оставляет за собой право отклонить заявку Заказчика на возврат денежных средств в случае выполнения Исполнителем услуги.',
        },
        {
          text: '6.4. Датой оплаты считается дата зачисления денежных средств на расчетный счет Исполнителя.',
        },
        {
          text: '6.5. Исполнитель предоставляет Услуги на условиях 100% предоплаты. По согласованию с Заказчиком может быть предоставлена рассрочка.',
        },
      ],
    },
    {
      title: '7. ПОРЯДОК СДАЧИ-ПРИЕМКИ ОКАЗАННЫХ УСЛУГ',
      subtitle: [
        {
          text: '7.1. Оказание Услуг Заказчику не оформляется составлением акта оказанных услуг.',
        },
        {
          text: '7.2. Предоставление Услуг в рамках настоящего Договора подтверждается самим фактом потребления Заказчиком оказанных ему Услуг.',
        },
      ],
    },
    {
      title: '8. ОТВЕТСТВЕННОСТЬ СТОРОН',
      subtitle: [
        {
          text: '8.1. За неисполнение, либо ненадлежащее исполнение своих обязательств по настоящему Договору виновная Сторона несет ответственность в соответствии с действующим законодательством Республики Беларусь, с учетом особенностей, установленных настоящим Договором.',
        },
        {
          text: '8.2. Нарушением условий Договора считается его невыполнение или ненадлежащее выполнение, то есть выполнение с нарушением условий, определенных содержанием Договора.',
        },
        {
          text: '8.3. В случае расторжения Договора по инициативе Заказчика, денежные средства, оплаченные Заказчиком за предоставленные Услуги, возврату не подлежат.',
        },
        {
          text: '8.4. Все споры, которые возникают по поводу выполнения настоящего Договора или связанные с ним, решаются путем проведения переговоров между Сторонами.',
        },
        {
          text: '8.5. Если соответствующий спор невозможно решить путем проведения переговоров, он решается в судебном порядке в соответствии с установленной подведомственностью и подсудностью такого спора, согласно действующему законодательству Республики Беларусь.',
        },
      ],
    },
    {
      title: '9. СРОК ДЕЙСТВИЯ ДОГОВОРА И ПОРЯДОК ЕГО РАСТОРЖЕНИЯ',
      subtitle: [
        {
          text: '9.1. Настоящий Договор считается заключенным с момента зачисления на расчетный счет Исполнителя денежных средств, уплаченных Заказчиком в счет оплаты заказанных им Услуг.',
        },
      ],
    },
    {
      title: '10. ПРОЧИЕ УСЛОВИЯ',
      subtitle: [
        {
          text: 'Стороны безоговорочно признают юридическую силу текста настоящего Договора.',
        },
      ],
    },
    {
      title: '11. РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ',
      subtitle: [
        {
          text: 'Асколок Анастасия Юрьевна',
        },
        {
          text: 'Могилевская область, г.Могилев, ул.Крупской, д.192',
        },
        {
          text: 'E-mail: askolok@gmail.com',
        },
      ],
    },
  ],
};
