import { IServiceCardProps } from '@/components/common/ServiceCard/ServiceCard.props';

export const services: IServiceCardProps[] = [
  {
    service:
      'Проектирование сайта (сбор и анализ требований, разработка технического задания, проектирование интерфейсов)',
    price: '15$/час',
  },
  {
    service:
      'Разработка креативной концепции сайта',
    price: '30$/час',
  },
  {
    service:
      'Создание дизайн-концепции сайта',
    price: '50$/час',
  },
  {
    service:
      'Создание макетов страниц',
    price: '35$/час',
  },
  {
    service:
      'Создание мультимедиа-объектов',
    price: '20$/час',
  },
  {
    service:
      'Вёрстка страниц и шаблонов',
    price: '50$/час',
  },
  {
    service:
      'Программирование (разработка функциональных инструментов) или интеграция в систему управления содержимым (CMS)',
    price: '100$/час',
  },
  {
    service:
      'Оптимизация и размещение материалов сайта',
    price: '40$/час',
  },
  {
    service:
      'Тестирование и внесение корректировок',
    price: '17$/час',
  },
  {
    service:
      'Публикация проекта на хостинге',
    price: '25$/час',
  },
  {
    service:
      'Обслуживание работающего сайта или его программной основы',
    price: '350$/сайт',
  },
];
